hpwit/FASTLEDVIRTUALDRIVER/platforms/esp/32/clockless_i2s_virtual_esp32.h
        i2s->timing.val = 0;
        
        // -- Allocate two DMA buffers
        dmaBuffers[0] = allocateDMABuffer((NUM_VIRT_PINS+1)*3*8*3*4);
        dmaBuffers[1] = allocateDMABuffer((NUM_VIRT_PINS+1)*3*8*3*4);
        dmaBuffers[2] = allocateDMABuffer((NUM_VIRT_PINS+1)*3*8*3*4);
		
        // -- Arrange them as a circularly linked list
        dmaBuffers[0]->descriptor.qe.stqe_next = &(dmaBuffers[1]->descriptor);
        dmaBuffers[1]->descriptor.qe.stqe_next = &(dmaBuffers[0]->descriptor);
        pu((uint32_t*)dmaBuffers[0]->buffer); //latch
		pu((uint32_t*)dmaBuffers[1]->buffer);
		//pu((uint32_t*)this->dmaBuffers[2]->buffer);
		pu2((uint32_t*)dmaBuffers[0]->buffer); //first pulse
		pu2((uint32_t*)dmaBuffers[1]->buffer);
	   
        // -- Allocate i2s interrupt
        SET_PERI_REG_BITS(I2S_INT_ENA_REG(I2S_DEVICE), I2S_OUT_EOF_INT_ENA_V, 1, I2S_OUT_EOF_INT_ENA_S);
        esp_err_t e = esp_intr_alloc(interruptSource, 0, // ESP_INTR_FLAG_INTRDISABLED | ESP_INTR_FLAG_LEVEL3,
                                     &interruptHandler, 0, &gI2S_intr_handle);
        
        // -- Create a semaphore to block execution until all the controllers are done
       /* if (gTX_sem == NULL) {
            gTX_sem = xSemaphoreCreateBinary();
            xSemaphoreGive(gTX_sem);
        }
        */
        // Serial.println("Init I2S");
        gInitialized = true;
    }
    
	static void pu(uint32_t* buff)
    {
	memset((uint8_t*)buff,0,(NUM_VIRT_PINS+1)*8*3*4*3);
	for (int i=0;i<24*3;i++)
		{
		 buff[NUM_VIRT_PINS+i*(NUM_VIRT_PINS+1)]=0x80000000;
		}
    }

   static void pu2(uint32_t* buff)
    {
	
	  
     for (int j=0;j<24;j++)
      {
      for (int i=0;i<NUM_VIRT_PINS;i++)
		{
		 *buff=0xFFFFF00;
		 buff++;
		}
		buff+=3*(NUM_VIRT_PINS+1)-NUM_VIRT_PINS; //13
      }
    }
	
    /** Clear DMA buffer
     *
     *  Yves' clever trick: initialize the bits that we know must be 0
     *  or 1 regardless of what bit they encode.
     */
    static void empty( uint32_t *buf)
    {
        for(int i=0;i<8*NUM_COLOR_CHANNELS;i++)
        {
            int offset=gPulsesPerBit*i;
            for(int j=0;j<ones_for_zero;j++)
                buf[offset+j]=0xffffffff;
            
            for(int j=ones_for_one;j<gPulsesPerBit;j++)
                buf[offset+j]=0;
        }
    }
    
    // -- Show pixels
    //    This is the main entry point for the controller.
    virtual void showPixels(PixelController<RGB_ORDER> & pixels)
    {
        
		//Serial.println("Show");
			int_leds=(CRGB*)pixels.mData;
			m_scale=pixels.mScale;
        nun_led_per_strip=  pixels.mLen;
			//Serial.printf("led - r:%d v:%d b%d\n",m_scale.r,m_scale.g,m_scale.b);
            for(int i=0;i<256;i++)
            {
                green_map[i]=(uint8_t)((int)(i*m_scale.g)/255);
                blue_map[i]=(uint8_t)((int)(i*m_scale.b)/255);
                red_map[i]=(uint8_t)((int)(i*m_scale.r)/255);
                // Serial.printf("led -  i:%d scale:%d r:%d v:%d b:%d\n",i,m_scale.r,green_map[i],red_map[i],blue_map[i]);
            }
			
			//for(int j=0;j<50;j++)
			//{
				//Serial.printf("led n:%d r:%d v:%d b%d\n",j,int_leds[j].r,int_leds[j].g,int_leds[j].b);
		//	}
                ledToDisplay=0;
        stopSignal=false;
 	
		pu((uint32_t*)dmaBuffers[0]->buffer); //latch
		pu((uint32_t*)dmaBuffers[1]->buffer);
		pu((uint32_t*)dmaBuffers[2]->buffer);
		//pu((uint32_t*)this->dmaBuffers[3]->buffer);
		pu2((uint32_t*)dmaBuffers[0]->buffer); //first pulse
		pu2((uint32_t*)dmaBuffers[1]->buffer);
		//pu2((uint32_t*)this->dmaBuffers[2]->buffer);
		fillbuffer6((uint32_t*)dmaBuffers[0]->buffer);
		 ledToDisplay++;
		//fillbuffer2((uint32_t*)dmaBuffers[1]->buffer);
		 //ledToDisplay++;

        dmaBufferActive=1;
		// this->dmaBuffers[3]->next(this->dmaBuffers[0]);
		/*
		 dmaBuffers[1]->next(this->dmaBuffers[0]);
		 dmaBuffers[2]->next(this->dmaBuffers[0]);
		 dmaBuffers[0]->next(this->dmaBuffers[1]); //on utilise le dernier buffer*/
		 dmaBuffers[1]->descriptor.qe.stqe_next = &(dmaBuffers[0]->descriptor);
        dmaBuffers[2]->descriptor.qe.stqe_next = &(dmaBuffers[0]->descriptor);
		dmaBuffers[0]->descriptor.qe.stqe_next = &(dmaBuffers[1]->descriptor);
        runningPixel=true;
        //startTX();
		i2sStart();
        while(runningPixel==true);
        delayMicroseconds(500);

    }
    
    // -- Custom interrupt handler
    static IRAM_ATTR void interruptHandler(void *arg)
    {
	
	/*
        if (i2s->int_st.out_eof) {
            i2s->int_clr.val = i2s->int_raw.val;
            
            if ( ! gDoneFilling) {
                fillBuffer6();
            } else {
                portBASE_TYPE HPTaskAwoken = 0;
                xSemaphoreGiveFromISR(gTX_sem, &HPTaskAwoken);
                if(HPTaskAwoken == pdTRUE) portYIELD_FROM_ISR();
            }
        }*/
		
        Lines pixel[3];
		 if (!i2s->int_st.out_eof)
		 return;
         i2s->int_clr.val = i2s->int_raw.val;
        if(stopSignal)
        {
           // Serial.println("stop");
            i2sStop();
            runningPixel=false;
            return;
        }
        if(ledToDisplay<=nun_led_per_strip)
        {
            
            
            
            
            
			
			if(ledToDisplay==nun_led_per_strip)
			{
				pu( (uint32_t*)dmaBuffers[dmaBufferActive]->buffer);

				            stopSignal=true;
			}
			fillbuffer6((uint32_t*)dmaBuffers[dmaBufferActive]->buffer);
			ledToDisplay++;
            dmaBufferActive = (dmaBufferActive + 1)% 2;
			//if(ledToDisplay)
        }
        else
        {
            //if no more pixels then we will read the other buffer and stop
           // if(ledToDisplay==nun_led_per_strip)
             //   ledToDisplay++;
            //if(ledToDisplay==nun_led_per_strip+1)
                stopSignal=true;
        }
    }
    
static void transpose24x1_noinline(unsigned char *A, uint8_t *B,uint8_t offset) {

    uint32_t  x, y, x1,y1,t,x2,y2;

    

    // Load the array and pack it into x and y.

    /*  y = (*(unsigned char*)(A) & 0xffff ) |  ((*(unsigned char*)(A+4) & 0xffffL )<<16) ;

