hpwit/FASTLEDVIRTUALDRIVER/platforms/esp/32/clockless_i2s_virtual_esp32.h
        *((uint32_t*)(B-3*72)) = (uint32_t)(((y & 0xff000000) >>16 |((y1&0xff000000)>>8 ) |((y2&0xff000000) )  ))&0xfffff00;
       // B-=offset;
        
        
        
        *((uint32_t*)(B-4*72)) =(uint32_t)(( (x & 0xff) |((x1&0xff) <<8)  |((x2&0xff) <<16))<<8 )&0xfffff00;
        //B-=offset;
        
        *((uint32_t*)(B-5*72)) = (uint32_t)(((x & 0xff00) |((x1&0xff00) <<8)    |((x2&0xff00) <<16)    ))&0xfffff00;
        //B-=offset;
        
        *((uint32_t*)(B-6*72)) = (uint32_t)( ( (  (x & 0xff0000) >>16)|((x1&0xff0000) >>8)   |((x2&0xff0000))   )<<8  )&0xfffff00;
        //B-=offset;
        
        *((uint32_t*)(B-7*72)) = (uint32_t)(((x & 0xff000000) >>16 |((x1&0xff000000)>>8 )    |((x2&0xff000000) )    ))&0xfffff00;
        
        
        
    }


static IRAM_ATTR void fillbuffer6(uint32_t *buff)
{
    //return;
	Lines firstPixel[3];
       // Lines secondPixel[3];
		int nblines=5;
 
  int nbpins=20;//	this->nbpins;
  
  
   uint32_t l2=ledToDisplay;
   //Serial.println(ledToDisplay);
    uint32_t offset=OFFSET;//(7)*(NUM_VIRT_PINS+1)*3+2*NUM_VIRT_PINS;
   for (int line=0;line<NUM_VIRT_PINS;line++){
   //uint32_t l=ledToDisplay+nun_led_per_strip*line;
     uint32_t l=l2;
	    for(int pin=0;pin<NBIS2SERIALPINS;pin++) {

	//uint32_t l=ledToDisplay+nun_led_per_strip*line+pin*nun_led_per_strip*5;
                firstPixel[C_G].bytes[pin] = green_map[int_leds[l].g];//(*poli).g/brightness_g; //scale8(int_leds[l].g,brightness_g);
                firstPixel[C_R].bytes[pin] = red_map[int_leds[l].r];//(*poli).r/brightness_r;
                firstPixel[C_B].bytes[pin] =blue_map[int_leds[l].b];
 /*
			firstPixel[0].bytes[pin] = int_leds[l].g/brightness_g; //scale8(int_leds[l].g,brightness_g);
            firstPixel[1].bytes[pin] = int_leds[l].r/brightness_r;
            firstPixel[2].bytes[pin] = int_leds[l].b/brightness_b;*/
			//l+=nun_led_per_strip*NUM_VIRT_PINS;
            l+=OFFSET2;

			}
			// l2+=nun_led_per_strip;
       l2+=NUM_LEDS_PER_STRIP;
			 /*
			transpose24x1_noinline(firstPixel[0].bytes,(uint8_t*)&buff[offset],(NUM_VIRT_PINS+1)*3*4);
        		transpose24x1_noinline(firstPixel[1].bytes,(uint8_t*)&buff[offset+8*(NUM_VIRT_PINS+1)*3],(NUM_VIRT_PINS+1)*3*4);
        		transpose24x1_noinline(firstPixel[2].bytes,(uint8_t*)&buff[offset+16*(NUM_VIRT_PINS+1)*3],(NUM_VIRT_PINS+1)*3*4);*/
       
       transpose24x1_noinline2(firstPixel[0].bytes,(uint8_t*)&buff[offset]);
       transpose24x1_noinline2(firstPixel[1].bytes,(uint8_t*)&buff[offset+144]);
       transpose24x1_noinline2(firstPixel[2].bytes,(uint8_t*)&buff[offset+288]);
				offset--;
				
		}
}

    
    /** Start I2S transmission
     */
    static void i2sStart()
    {
        // esp_intr_disable(gI2S_intr_handle);
        // Serial.println("I2S start");
        i2sReset();
        //Serial.println(dmaBuffers[0]->sampleCount());
        i2s->lc_conf.val=I2S_OUT_DATA_BURST_EN | I2S_OUTDSCR_BURST_EN | I2S_OUT_DATA_BURST_EN;
		//i2s.rx_eof_num = dmaBuffers[2]->sampleCount();
        i2s->out_link.addr = (uint32_t) & (dmaBuffers[2]->descriptor);
			//i2s.in_link.addr = (uint32_t) & (dmaBuffers[2]->descriptor);
        i2s->out_link.start = 1;
        ////vTaskDelay(5);
        i2s->int_clr.val = i2s->int_raw.val;
        // //vTaskDelay(5);
        i2s->int_ena.out_dscr_err = 1;
        //enable interrupt
        ////vTaskDelay(5);
        esp_intr_enable(gI2S_intr_handle);
        // //vTaskDelay(5);
        i2s->int_ena.val = 0;
        i2s->int_ena.out_eof = 1;
        
        //start transmission
        i2s->conf.tx_start = 1;
    }
    
    static void i2sReset()
    {
        // Serial.println("I2S reset");
        const unsigned long lc_conf_reset_flags = I2S_IN_RST_M | I2S_OUT_RST_M | I2S_AHBM_RST_M | I2S_AHBM_FIFO_RST_M;
        i2s->lc_conf.val |= lc_conf_reset_flags;
        i2s->lc_conf.val &= ~lc_conf_reset_flags;
        
        const uint32_t conf_reset_flags = I2S_RX_RESET_M | I2S_RX_FIFO_RESET_M | I2S_TX_RESET_M | I2S_TX_FIFO_RESET_M;
        i2s->conf.val |= conf_reset_flags;
        i2s->conf.val &= ~conf_reset_flags;
    }
    
    static void i2sReset_DMA()
    {
        i2s->lc_conf.in_rst=1; i2s->lc_conf.in_rst=0;
        i2s->lc_conf.out_rst=1; i2s->lc_conf.out_rst=0;
    }
    
    static void i2sReset_FIFO()
    {
        i2s->conf.rx_fifo_reset=1; i2s->conf.rx_fifo_reset=0;
        i2s->conf.tx_fifo_reset=1; i2s->conf.tx_fifo_reset=0;
    }
    
    static void i2sStop()
    {
        // Serial.println("I2S stop");
        esp_intr_disable(gI2S_intr_handle);
        i2sReset();
        i2s->conf.rx_start = 0;
        i2s->conf.tx_start = 0;
    }
};

FASTLED_NAMESPACE_END
